In [1]:
import numpy as np
import pandas as pd

In [5]:
#task 2 create series
two_ser = pd.Series([2,3,5,7,11,13])
two_ser

0     2
1     3
2     5
3     7
4    11
5    13
dtype: int64

In [26]:
#task 2 
two_df = pd.DataFrame(
    {'prime': [2,3,5,7,11,13],
     'composite': ['4', '6', '8', '9', '10', '12']})
print(two_df)

   prime composite
0      2         4
1      3         6
2      5         8
3      7         9
4     11        10
5     13        12

In [27]:
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0 -1.123091 -2.208096  0.350209  0.026407
1  0.047286 -1.233264 -1.519035  0.392639
2 -0.514602 -0.512926  0.529863  0.690864
3 -1.729325 -0.152496  2.609690 -0.166955
4 -0.515268  0.167649 -1.219858  1.251526
5  0.343615  0.539024  0.223617  0.423865

In [86]:
ones = pd.DataFrame(np.random.randn(10,5), 
                index =('Andy','Betty','Chuck','Darla','Ed',
                        'Fay','Greg','Hilda','Indigo','Julie'),
                columns =('homework','test','quiz','attendance','participation'))
scores = (ones/ones)*85 + 7*pd.DataFrame(np.random.randn(10,5), 
                index =('Andy','Betty','Chuck','Darla','Ed',
                        'Fay','Greg','Hilda','Indigo','Julie'),
                columns =('homework','test','quiz','attendance','participation'))
print(scores)

         homework       test       quiz  attendance  participation
Andy    92.256464  95.433278  81.524124   76.100187      81.128687
Betty   79.877933  98.936640  99.309007   81.174938      92.166556
Chuck   83.543575  83.290473  71.498939   77.949088      94.750775
Darla   94.001286  70.918286  97.753586   74.107690      89.295688
Ed      89.742415  82.630222  73.609358   78.761147      86.380419
Fay     90.581275  70.764884  90.688707   92.336092      83.868573
Greg    92.178135  69.546348  77.602117   85.466851      80.587269
Hilda   92.385804  80.340040  85.846458   82.997345      87.575643
Indigo  76.992412  80.360620  84.691204   92.526140      76.817763
Julie   89.146255  82.092374  88.574401   73.808098      79.231188

In [67]:
file = np.genfromtxt("iris.csv", dtype = 'float', delimiter = ',', skip_header = 1, usecols =(0,1,2,3))
print(file.shape)

(150, 4)

In [69]:
iris_df = pd.read_csv('iris.csv')

In [76]:
#task 4
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [71]:
iris_df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [74]:
iris_df.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
27            5.2          3.5           1.5          0.2      setosa
84            5.4          3.0           4.5          1.5  versicolor
123           6.3          2.7           4.9          1.8   virginica
95            5.7          3.0           4.2          1.2  versicolor
107           7.3          2.9           6.3          1.8   virginica

In [75]:
iris_df.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
101           5.8          2.7           5.1          1.9   virginica
78            6.0          2.9           4.5          1.5  versicolor
30            4.8          3.1           1.6          0.2      setosa
149           5.9          3.0           5.1          1.8   virginica
2             4.7          3.2           1.3          0.2      setosa

In [77]:
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [87]:
print(scores.head())
print("****Sample")
print(scores.sample())
print("****Stats")
print(scores.describe())

        homework       test       quiz  attendance  participation
Andy   92.256464  95.433278  81.524124   76.100187      81.128687
Betty  79.877933  98.936640  99.309007   81.174938      92.166556
Chuck  83.543575  83.290473  71.498939   77.949088      94.750775
Darla  94.001286  70.918286  97.753586   74.107690      89.295688
Ed     89.742415  82.630222  73.609358   78.761147      86.380419
****Sample
        homework       test       quiz  attendance  participation
Darla  94.001286  70.918286  97.753586    74.10769      89.295688
****Stats
        homework       test       quiz  attendance  participation
count  10.000000  10.000000  10.000000   10.000000      10.000000
mean   88.070555  81.431317  85.109790   81.522758      85.180256
std     5.857406   9.864124   9.381225    6.832561       5.860150
min    76.992412  69.546348  71.498939   73.808098      76.817763
25%    84.944245  73.273724  78.582619   76.562412      80.722623
50%    90.161845  81.226497  85.268831   79.968042      85.124496
75%    92.236882  83.125410  90.160131   84.849475      88.865677
max    94.001286  98.936640  99.309007   92.526140      94.750775

In [89]:
#task 5
iris_df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [90]:
iris_df.index

RangeIndex(start=0, stop=150, step=1)

In [92]:
print(scores.columns)
print('****')
print(scores.index)

Index(['homework', 'test', 'quiz', 'attendance', 'participation'], dtype='object')
****
Index(['Andy', 'Betty', 'Chuck', 'Darla', 'Ed', 'Fay', 'Greg', 'Hilda',
       'Indigo', 'Julie'],
      dtype='object')

In [93]:
pd.__version__

'0.25.1'

In [96]:
my_iris = iris_df.to_dict()
my_scores = scores.to_dict()

In [97]:
slength = iris_df['sepal_length']
slength.head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

In [98]:
print('1st row')
print(iris_df[0:1])
print('1st 5 rows')
print(iris_df[0:5])

1st row
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1st 5 rows
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [99]:
print('1st row')
print(iris_df.loc[0])
print('1st 2 rows')
print(iris_df.loc[0:1])

1st row
sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object
1st 2 rows
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [100]:
df.head(2)

          0         1         2         3
0 -1.123091 -2.208096  0.350209  0.026407
1  0.047286 -1.233264 -1.519035  0.392639

In [103]:
print('rows 4 through 6')
print(iris_df.loc[4:6, 'sepal_width': 'petal_width'])

rows 4 through 6
   sepal_width  petal_length  petal_width
4          3.6           1.4          0.2
5          3.9           1.7          0.4
6          3.4           1.4          0.3

In [105]:
print(iris_df.loc[4:6, ['sepal_width', 'petal_width']])

   sepal_width  petal_width
4          3.6          0.2
5          3.9          0.4
6          3.4          0.3

In [107]:
print(iris_df.iloc[0])
print('----')
print(iris_df.iloc[2:5, :-1])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object
----
   sepal_length  sepal_width  petal_length  petal_width
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [108]:
df_2 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': [5, 6, 7, 8, 9]})
df_2

   alpha  beta
0      0     5
1      1     6
2      2     7
3      3     8
4      4     9

In [109]:
df_2 > 1.0

   alpha  beta
0  False  True
1  False  True
2   True  True
3   True  True
4   True  True

In [110]:
condition = iris_df['sepal_length'] > 5.8
condition

0      False
1      False
2      False
3      False
4      False
       ...
145     True
146     True
147     True
148     True
149     True
Name: sepal_length, Length: 150, dtype: bool

In [111]:
iris_df[condition].head()

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
54           6.5          2.8           4.6          1.5  versicolor
56           6.3          3.3           4.7          1.6  versicolor

In [112]:
iris_df[iris_df['sepal_length'] > 5.8].head()

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
54           6.5          2.8           4.6          1.5  versicolor
56           6.3          3.3           4.7          1.6  versicolor

In [124]:
cond_one = iris_df[iris_df['sepal_width']< 2.5]
cond_two = cond_one[cond_one['petal_length'] > 3]
cond_two

     sepal_length  sepal_width  petal_length  petal_width     species
53            5.5          2.3           4.0          1.3  versicolor
57            4.9          2.4           3.3          1.0  versicolor
60            5.0          2.0           3.5          1.0  versicolor
62            6.0          2.2           4.0          1.0  versicolor
68            6.2          2.2           4.5          1.5  versicolor
80            5.5          2.4           3.8          1.1  versicolor
81            5.5          2.4           3.7          1.0  versicolor
87            6.3          2.3           4.4          1.3  versicolor
93            5.0          2.3           3.3          1.0  versicolor
119           6.0          2.2           5.0          1.5   virginica